app/Services/AdminActivityLogger.php

    public function log(string $module, string $action, ?Model $subject = null, array $old = [], array $new = []): void
    {
        $adminId = auth('admin')->id();

        AdminActivityLog::query()->create([
            'admin_user_id' => is_numeric($adminId) ? (int) $adminId : null,
            'module' => Str::limit($module, 100, ''),
            'action' => Str::limit($action, 100, ''),
            'subject_type' => $subject !== null ? $subject->getMorphClass() : null,
            'subject_id' => $subject?->getKey(),
            'old_values' => $old === [] ? null : $this->stripSensitive($old),
            'new_values' => $new === [] ? null : $this->stripSensitive($new),
            'ip_address' => request()->ip(),
            'user_agent' => Str::limit((string) request()->userAgent(), 2000, ''),
            'created_at' => now(),
        ]);
---
insert into `admin_activity_logs` (`admin_user_id`, `module`, `action`, `subject_type`, `subject_id`, `old_values`, `new_values`, `ip_address`, `user_agent`, `created_at`) values (1, 'settings', 'update_store', 'App\\Models\\Store', 1, null, '{\"store_id\":1,\"name\":\"Rushan\'s Store\"}', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/148.0.0.0 Safari/537.36', '2026-05-24 21:57:13')