app/Services/CartService.php

select exists(select * from `inventory_stocks` where `product_id` = 5 and `variant_id` = 69) as `exists`
---
    public function getAvailableStock(Product $product, ?ProductVariant $variant = null): float
    {
        $key = $product->getKey().'-'.($variant?->getKey() ?? '0');

        if (isset($this->stockCache[$key])) {
            return $this->stockCache[$key];
        }

        if ($this->allowsUnlimitedStock($product, $variant)) {
            $this->stockCache[$key] = self::UNLIMITED;

            return self::UNLIMITED;
        }

        if ($this->isBlockedOutOfStock($product, $variant)) {
            $this->stockCache[$key] = 0.0;

            return 0.0;
        }

        if ($variant !== null) {
            $hasInventory = InventoryStock::query()
                ->where('product_id', $product->getKey())
                ->where('variant_id', $variant->getKey())
                ->exists();

select exists(select * from `inventory_stocks` where `product_id` = 3 and `variant_id` is null) as `exists`
select sum(`available_quantity`) as aggregate from `inventory_stocks` where `product_id` = 3 and `variant_id` is null
---
            return $this->stockCache[$key];
        }

        $hasInventory = InventoryStock::query()
            ->where('product_id', $product->getKey())
            ->whereNull('variant_id')
            ->exists();

        if ($hasInventory) {
            $sum = (float) InventoryStock::query()
                ->where('product_id', $product->getKey())
                ->whereNull('variant_id')
                ->sum('available_quantity');

insert into `carts` (`customer_id`, `session_id`, `status`, `currency_code`, `expires_at`, `updated_at`, `created_at`) values (null, '3NkJMHYzkMwjeSU81APhTg3m1mcs4T4ljwSi2EwT', 'active', 'LKR', '2026-06-23 17:37:59', '2026-05-24 17:37:59', '2026-05-24 17:37:59')
---
    private function createNewCart(): Cart
    {
        $customer = $this->authenticatedCustomer();

        $cart = Cart::create([
            'customer_id' => $customer?->getKey(),
            'session_id' => $customer !== null ? null : $this->guestSessionIdentifier(),
            'status' => 'active',
            'currency_code' => $this->resolveStoreCurrency(),
            'expires_at' => now()->addDays(30),
        ]);