app/Services/ReportService.php

select count(*) as aggregate from `orders` where `orders`.`deleted_at` is null
select count(*) as aggregate from `orders` where `payment_status` in ('paid', 'partially_paid') and `orders`.`deleted_at` is null
select count(*) as aggregate from `orders` where `status` = 'pending' and `orders`.`deleted_at` is null
select count(*) as aggregate from `orders` where `status` = 'cancelled' and `orders`.`deleted_at` is null
select count(*) as aggregate from `customers` where `customers`.`deleted_at` is null
select count(*) as aggregate from `products` where `manage_stock` = 1 and `low_stock_threshold` is not null and `stock_quantity` is not null and `stock_quantity` <= `low_stock_threshold` and `products`.`deleted_at` is null
select count(*) as aggregate from `products` where `manage_stock` = 1 and (`stock_status` = 'out_of_stock' or `stock_quantity` <= 0) and `products`.`deleted_at` is null
select * from `customers` where `customers`.`id` in (2, 3) and `customers`.`deleted_at` is null
select * from `orders` where `orders`.`id` in (2, 3, 4) and `orders`.`deleted_at` is null
select * from `payments` order by `paid_at` desc limit 10
---
    public function dashboardStats(array $filters = []): array
    {
        $orders = $this->ordersBaseQuery($filters)->with(['customer'])->latest('placed_at');

        $totalOrders = (clone $orders)->count();
        $paidOrders = (clone $orders)->whereIn('payment_status', ['paid', 'partially_paid'])->count();
        $pendingOrders = (clone $orders)->where('status', 'pending')->count();
        $cancelledOrders = (clone $orders)->where('status', 'cancelled')->count();

        $salesOrders = $this->salesOrdersQuery($filters);
        $grossSales = (float) (clone $salesOrders)->sum('grand_total');
        $refundedTotal = (float) (clone $salesOrders)->sum('refunded_total');
        $netSales = max(0.0, $grossSales - $refundedTotal);
        $averageOrderValue = $paidOrders > 0 ? ($grossSales / $paidOrders) : 0.0;
        $netProfit = $this->netProfit($filters);

        $newCustomers = $this->applyDateRange(Customer::query(), 'created_at', $filters)->count();
        $totalCustomers = Customer::query()->count();

        $lowStockProducts = Product::query()
            ->where('manage_stock', true)
            ->whereNotNull('low_stock_threshold')
            ->whereNotNull('stock_quantity')
            ->whereColumn('stock_quantity', '<=', 'low_stock_threshold')
            ->count();

        $outOfStockProducts = Product::query()
            ->where('manage_stock', true)
            ->where(function (Builder $query): void {
                $query->where('stock_status', 'out_of_stock')
                    ->orWhere('stock_quantity', '<=', 0);
            })
            ->count();

        $recentOrders = (clone $orders)
            ->with(['customer'])
            ->limit(10)
            ->get();

        $topProducts = $this->topProducts($filters, 10);

        $recentPayments = $this->applyDateRange(Payment::query()->with(['order', 'method']), 'paid_at', $filters)
            ->latest('paid_at')
            ->limit(10)
            ->get();

select * from `customers` where `customers`.`id` in (2, 3) and `customers`.`deleted_at` is null
select * from `orders` where `orders`.`deleted_at` is null order by `placed_at` desc limit 20 offset 0
select count(*) as aggregate from `orders` where `orders`.`deleted_at` is null
---
    public function orderReport(array $filters = []): LengthAwarePaginator
    {
        $query = $this->ordersBaseQuery($filters)
            ->with(['customer'])
            ->latest('placed_at');

        return $query->paginate(20)->withQueryString();

select DATE(placed_at) as period, COUNT(*) as orders_count, SUM(grand_total) as revenue from `orders` where `placed_at` >= '2026-05-11 00:00:00' and `placed_at` <= '2026-05-24 23:59:59' and `payment_status` in ('paid', 'partially_paid') and `orders`.`deleted_at` is null group by `period` order by `period` asc
---
    private function revenueTrend(array $filters, int $days = 14): array
    {
        $to = ($this->parseDate($filters['date_to'] ?? null) ?? now())->copy()->startOfDay();
        $from = ($this->parseDate($filters['date_from'] ?? null) ?? $to->copy()->subDays($days - 1))->copy()->startOfDay();

        if ($from->gt($to)) {
            [$from, $to] = [$to, $from];
        }

        if ($from->diffInDays($to) > 30) {
            $from = $to->copy()->subDays(30);
        }

        $rangeFilters = array_merge($filters, [
            'date_from' => $from->toDateString(),
            'date_to' => $to->toDateString(),
        ]);

        $rows = $this->salesOrdersQuery($rangeFilters)
            ->selectRaw('DATE(placed_at) as period')
            ->selectRaw('COUNT(*) as orders_count')
            ->selectRaw('SUM(grand_total) as revenue')
            ->groupBy('period')
            ->orderBy('period')
            ->get()
            ->keyBy(fn ($row) => Carbon::parse((string) $row->period)->toDateString());

select status, COUNT(*) as total from `orders` where `orders`.`deleted_at` is null group by `status` order by `total` desc
---
    private function orderStatuses(array $filters): Collection
    {
        return $this->ordersBaseQuery($filters)
            ->selectRaw('status, COUNT(*) as total')
            ->groupBy('status')
            ->orderByDesc('total')
            ->get()
            ->map(fn ($row) => [
                'status' => (string) ($row->status ?? 'unknown'),
                'total' => (int) ($row->total ?? 0),
            ]);

select COALESCE(payment_methods.provider, payment_methods.name, 'Manual') as source, SUM(payments.amount) as amount from `payments` left join `payment_methods` on `payment_methods`.`id` = `payments`.`payment_method_id` where `payments`.`status` in ('paid', 'captured', 'succeeded', 'completed') group by `source` order by `amount` desc limit 6
---
    private function paymentSources(array $filters): Collection
    {
        return $this->applyDateRange(
            Payment::query()->leftJoin('payment_methods', 'payment_methods.id', '=', 'payments.payment_method_id'),
            'payments.paid_at',
            $filters
        )
            ->selectRaw("COALESCE(payment_methods.provider, payment_methods.name, 'Manual') as source")
            ->selectRaw('SUM(payments.amount) as amount')
            ->whereIn('payments.status', ['paid', 'captured', 'succeeded', 'completed'])
            ->groupBy('source')
            ->orderByDesc('amount')
            ->limit(6)
            ->get()
            ->map(fn ($row) => [
                'source' => (string) ($row->source ?? 'Manual'),
                'amount' => (float) ($row->amount ?? 0),
            ]);

select COALESCE(categories.name, 'Uncategorized') as name, SUM(order_items.total) as revenue from `order_items` inner join (select `id` from `orders` where `payment_status` in ('paid', 'partially_paid') and `orders`.`deleted_at` is null) as `paid_orders` on `order_items`.`order_id` = `paid_orders`.`id` left join `product_categories` on `product_categories`.`product_id` = `order_items`.`product_id` left join `categories` on `categories`.`id` = `product_categories`.`category_id` group by `name` order by `revenue` desc limit 6
---
    private function topCategories(array $filters, int $limit): Collection
    {
        $orders = $this->salesOrdersQuery($filters)->select('id');

        return OrderItem::query()
            ->joinSub($orders, 'paid_orders', fn ($j) => $j->on('order_items.order_id', '=', 'paid_orders.id'))
            ->leftJoin('product_categories', 'product_categories.product_id', '=', 'order_items.product_id')
            ->leftJoin('categories', 'categories.id', '=', 'product_categories.category_id')
            ->selectRaw("COALESCE(categories.name, 'Uncategorized') as name")
            ->selectRaw('SUM(order_items.total) as revenue')
            ->groupBy('name')
            ->orderByDesc('revenue')
            ->limit($limit)
            ->get()
            ->map(fn ($row) => [
                'name' => (string) ($row->name ?? 'Uncategorized'),
                'revenue' => (float) ($row->revenue ?? 0),
            ]);

select count(*) as aggregate from `products` where `manage_stock` = 1 and `low_stock_threshold` is not null and `stock_quantity` is not null and `stock_quantity` <= `low_stock_threshold` and `products`.`deleted_at` is null
select count(*) as aggregate from `products` where `manage_stock` = 1 and (`stock_status` = 'out_of_stock' or `stock_quantity` <= 0) and `products`.`deleted_at` is null
select count(*) as aggregate from `products` where `manage_stock` = 1 and `stock_quantity` > 0 and (`low_stock_threshold` is null or `stock_quantity` > `low_stock_threshold`) and `products`.`deleted_at` is null
select count(distinct `product_id`) as aggregate from `order_items` where `created_at` >= '2026-05-17 21:43:44'
---
    private function stockHealth(): array
    {
        $low = Product::query()
            ->where('manage_stock', true)
            ->whereNotNull('low_stock_threshold')
            ->whereNotNull('stock_quantity')
            ->whereColumn('stock_quantity', '<=', 'low_stock_threshold')
            ->count();

        $out = Product::query()
            ->where('manage_stock', true)
            ->where(function (Builder $query): void {
                $query->where('stock_status', 'out_of_stock')
                    ->orWhere('stock_quantity', '<=', 0);
            })
            ->count();

        $healthy = Product::query()
            ->where('manage_stock', true)
            ->where('stock_quantity', '>', 0)
            ->where(function (Builder $query): void {
                $query->whereNull('low_stock_threshold')
                    ->orWhereColumn('stock_quantity', '>', 'low_stock_threshold');
            })
            ->count();

        $fastSelling = OrderItem::query()
            ->where('created_at', '>=', now()->subDays(7))
            ->distinct('product_id')
            ->count('product_id');

select order_items.product_id as product_id, COALESCE(products.name, order_items.product_name) as product_name, SUM(order_items.quantity) as sold_quantity, SUM(order_items.total) as revenue from `order_items` inner join (select `id` from `orders` where `payment_status` in ('paid', 'partially_paid') and `orders`.`deleted_at` is null) as `paid_orders` on `order_items`.`order_id` = `paid_orders`.`id` left join `products` on `products`.`id` = `order_items`.`product_id` group by `order_items`.`product_id`, `products`.`name`, `order_items`.`product_name` order by `revenue` desc limit 10
---
    private function topProducts(array $filters, int $limit): Collection
    {
        $orders = $this->salesOrdersQuery($filters)->select('id');

        return OrderItem::query()
            ->joinSub($orders, 'paid_orders', fn ($j) => $j->on('order_items.order_id', '=', 'paid_orders.id'))
            ->leftJoin('products', 'products.id', '=', 'order_items.product_id')
            ->selectRaw('order_items.product_id as product_id')
            ->selectRaw('COALESCE(products.name, order_items.product_name) as product_name')
            ->selectRaw('SUM(order_items.quantity) as sold_quantity')
            ->selectRaw('SUM(order_items.total) as revenue')
            ->groupBy('order_items.product_id', 'products.name', 'order_items.product_name')
            ->orderByDesc('revenue')
            ->limit($limit)
            ->get()
            ->map(fn ($r) => [
                'product_id' => (int) ($r->product_id ?? 0),
                'product_name' => (string) ($r->product_name ?? '—'),
                'sold_quantity' => (float) ($r->sold_quantity ?? 0),
                'revenue' => (float) ($r->revenue ?? 0),
            ]);