app/Services/ReportService.php

select * from `orders` where `orders`.`deleted_at` is null order by `placed_at` desc limit 10
---
    public function dashboardStats(array $filters = []): array
    {
        $orders = $this->ordersBaseQuery($filters)->with(['customer'])->latest('placed_at');

        $totalOrders = (clone $orders)->count();
        $paidOrders = (clone $orders)->whereIn('payment_status', ['paid', 'partially_paid'])->count();
        $pendingOrders = (clone $orders)->where('status', 'pending')->count();
        $cancelledOrders = (clone $orders)->where('status', 'cancelled')->count();

        $salesOrders = $this->salesOrdersQuery($filters);
        $grossSales = (float) (clone $salesOrders)->sum('grand_total');
        $refundedTotal = (float) (clone $salesOrders)->sum('refunded_total');
        $netSales = max(0.0, $grossSales - $refundedTotal);
        $averageOrderValue = $paidOrders > 0 ? ($grossSales / $paidOrders) : 0.0;

        $newCustomers = $this->applyDateRange(Customer::query(), 'created_at', $filters)->count();

        $lowStockProducts = Product::query()
            ->where('manage_stock', true)
            ->whereNotNull('low_stock_threshold')
            ->whereNotNull('stock_quantity')
            ->whereColumn('stock_quantity', '<=', 'low_stock_threshold')
            ->count();

        $recentOrders = (clone $orders)
            ->with(['customer'])
            ->limit(10)
            ->get();