app/Services/SettingService.php

    public function set(string $key, mixed $value, string $type = 'string', string $group = 'general', bool $isPublic = false): void
    {
        $stored = $this->encodeForStorage($type, $value);

        SystemSetting::query()->updateOrCreate(
            ['key' => $key],
            [
                'value' => $stored,
                'type' => $type,
                'group' => $group,
                'is_public' => $isPublic,
            ],
        );
---
select * from `system_settings` where (`key` = 'store.name') limit 1

    public function publicSettings(): array
    {
        $rows = SystemSetting::query()
            ->where('is_public', true)
            ->get(['key', 'value', 'type']);
---
select `key`, `value`, `type` from `system_settings` where `is_public` = 1

    private function allCached(): array
    {
        /** @var array<string, mixed> */
        return Cache::rememberForever(self::CACHE_KEY, function (): array {
            $rows = SystemSetting::query()->get(['key', 'value', 'type']);
---
select `key`, `value`, `type` from `system_settings`