app/Services/StoreService.php

select * from `stores` order by `id` asc limit 1
---
    public function currentStore(): Store
    {
        $store = Store::query()->orderBy('id')->first();

update `stores` set `name` = 'Rushan\'s Store', `legal_name` = 'Rushan\'s Store', `stores`.`updated_at` = '2026-05-24 21:57:13' where `id` = 1
---
    public function updateStore(array $data): Store
    {
        $store = $this->currentStore();
        $store->fill($data);
        $store->save();