app/Services/Cms/MenuService.php

    public function getMenuByLocation(string $location): ?Menu
    {
        return Menu::query()
            ->where('location', $location)
            ->where('status', 'active')
            ->latest('id')
            ->first();
---
select * from `menus` where `location` = 'header' and `status` = 'active' order by `id` desc limit 1