app/Http/Controllers/Customer/HomeController.php

    public function index(): View
    {
        $parentCategories = Category::query()
            ->active()
            ->whereNull('parent_id')
            ->withCount([
                'activeChildren',
                'products as storefront_products_count' => fn (Builder $q) => $q->forStorefront(),
            ])
            ->orderBy('sort_order')
            ->orderBy('name')
            ->get();

        $brands = Brand::query()
            ->active()
            ->withCount(['products as storefront_products_count' => fn (Builder $q) => $q->forStorefront()])
            ->having('storefront_products_count', '>', 0)
            ->orderBy('name')
            ->limit(12)
            ->get();

        $featuredProducts = Product::query()
            ->forStorefront()
            ->featured()
            ->with([
                'brand',
                'categories',
                'primaryImage',
                'variants' => fn ($q) => $q->active()->select(['id', 'product_id', 'regular_price', 'sale_price', 'stock_status']),
            ])
            ->orderByDesc('id')
            ->limit(8)
            ->get();

        $latestProducts = Product::query()
            ->forStorefront()
            ->with([
                'brand',
                'categories',
                'primaryImage',
                'variants' => fn ($q) => $q->active()->select(['id', 'product_id', 'regular_price', 'sale_price', 'stock_status']),
            ])
            ->orderByDesc('id')
            ->limit(8)
            ->get();
---
select * from `brands` where `brands`.`id` in (1, 2, 4, 5) and `brands`.`deleted_at` is null
select `categories`.*, `product_categories`.`product_id` as `pivot_product_id`, `product_categories`.`category_id` as `pivot_category_id`, `product_categories`.`created_at` as `pivot_created_at`, `product_categories`.`updated_at` as `pivot_updated_at` from `categories` inner join `product_categories` on `categories`.`id` = `product_categories`.`category_id` where `product_categories`.`product_id` in (1, 2, 4, 5) and `categories`.`deleted_at` is null
select * from `brands` where `brands`.`id` in (1, 2, 3, 4, 5) and `brands`.`deleted_at` is null
select `categories`.*, `product_categories`.`product_id` as `pivot_product_id`, `product_categories`.`category_id` as `pivot_category_id`, `product_categories`.`created_at` as `pivot_created_at`, `product_categories`.`updated_at` as `pivot_updated_at` from `categories` inner join `product_categories` on `categories`.`id` = `product_categories`.`category_id` where `product_categories`.`product_id` in (1, 2, 3, 4, 5) and `categories`.`deleted_at` is null