app/Http/Controllers/Customer/ProductController.php

    public function show(Product $product): View
    {
        $product->load([
            'brand',
            'categories',
            'images' => fn ($q) => $q->orderBy('sort_order')->orderBy('id'),
            'primaryImage',
            'variants' => fn ($q) => $q->active()->orderBy('id')->with(['values.attribute', 'values.value']),
            'attributeAssignments' => fn ($q) => $q->with(['attribute', 'value']),
        ]);

        $categoryIds = $product->categories->pluck('id')->all();

        $relatedProducts = Product::query()
            ->forStorefront()
            ->where('id', '!=', $product->getKey())
            ->when($categoryIds !== [], function ($q) use ($categoryIds): void {
                $q->whereHas('categories', function ($cq) use ($categoryIds): void {
                    $cq->whereIn('categories.id', $categoryIds);
                });
            })
            ->with(['brand', 'primaryImage', 'variants' => fn ($vq) => $vq->active()->select(['id', 'product_id', 'regular_price', 'sale_price', 'stock_status'])])
            ->orderByDesc('id')
            ->limit(4)
            ->get();
---
select * from `brands` where `brands`.`id` in (5) and `brands`.`deleted_at` is null
select * from `product_attribute_assignments` where `product_attribute_assignments`.`product_id` in (5)
select `categories`.*, `product_categories`.`product_id` as `pivot_product_id`, `product_categories`.`category_id` as `pivot_category_id`, `product_categories`.`created_at` as `pivot_created_at`, `product_categories`.`updated_at` as `pivot_updated_at` from `categories` inner join `product_categories` on `categories`.`id` = `product_categories`.`category_id` where `product_categories`.`product_id` in (5) and `categories`.`deleted_at` is null
select * from `brands` where `brands`.`id` in (2) and `brands`.`deleted_at` is null