app/Models/Product.php

select count(*) as aggregate from `product_reviews` where `product_reviews`.`product_id` = 5 and `product_reviews`.`product_id` is not null and `status` = 'approved'
---
    public function approvedReviews(): HasMany
    {
        return $this->hasMany(ProductReview::class)->where('status', 'approved');