app/Providers/AppServiceProvider.php

select count(*) as aggregate from `notifications` where `recipient_type` = 'admin' and (`recipient_id` is null or `recipient_id` = 1) and `read_at` is null
---
            $admin = auth('admin')->user();
            $adminUnreadNotificationCount = 0;
            if ($admin instanceof AdminUser) {
                $adminUnreadNotificationCount = Notification::query()
                    ->where('recipient_type', 'admin')
                    ->where(function ($q) use ($admin): void {
                        $q->whereNull('recipient_id')
                            ->orWhere('recipient_id', $admin->getKey());
                    })
                    ->whereNull('read_at')
                    ->count();