app/Http/Controllers/Admin/CouponController.php

    public function index(Request $request): View
    {
        $q = trim((string) $request->get('q', ''));
        $type = (string) $request->get('type', '');
        $status = (string) $request->get('status', '');

        $coupons = Coupon::query()
            ->when($q !== '', function ($query) use ($q) {
                $like = '%'.str_replace(['%', '_'], ['\%', '\_'], $q).'%';
                $query->where('code', 'like', $like)->orWhere('name', 'like', $like);
            })
            ->when($type !== '', fn ($query) => $query->where('type', $type))
            ->when($status !== '', fn ($query) => $query->where('status', $status))
            ->latest('id')
            ->paginate(20)
            ->withQueryString();
---
select * from `coupons` where `coupons`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `coupons` where `coupons`.`deleted_at` is null