app/Http/Controllers/Admin/OrderController.php

select * from `customers` where `customers`.`id` in (2, 3) and `customers`.`deleted_at` is null
select * from `orders` where `orders`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `orders` where `orders`.`deleted_at` is null
---
    public function index(Request $request): View
    {
        $query = Order::query()
            ->with(['customer', 'latestPayment.method'])
            ->orderByDesc('id');

        if ($request->filled('q')) {
            $q = '%'.trim((string) $request->input('q')).'%';
            $query->where(function ($w) use ($q): void {
                $w->where('order_number', 'like', $q)
                    ->orWhere('customer_email', 'like', $q)
                    ->orWhere('customer_phone', 'like', $q);
            });
        }

        foreach (['status', 'payment_status', 'fulfillment_status'] as $field) {
            if ($request->filled($field)) {
                $query->where($field, $request->input($field));
            }
        }

        if ($request->filled('date_from')) {
            $query->whereDate('created_at', '>=', $request->input('date_from'));
        }
        if ($request->filled('date_to')) {
            $query->whereDate('created_at', '<=', $request->input('date_to'));
        }

        $orders = $query->paginate(20)->withQueryString();